VV_cases/V4a_2D/templates/base_case/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// V4a: buoyantPimpleFoam, 2-D, Pt/D=2.667, symmetry BC, Re=100
// Unsteady — Karman shedding expected around Re=100.
// This is the 2-D reference for comparison with V4b (3-D + fins).

application     buoyantPimpleFoam;

startFrom       latestTime;
startTime       0;
stopAt          endTime;
endTime         30;

deltaT          5e-4;
adjustTimeStep  no;
maxCo           0.8;

writeControl    runTime;
writeInterval   0.1;

purgeWrite      0;
writeFormat     ascii;
writePrecision  8;
writeCompression off;
timeFormat      general;
timePrecision   8;
runTimeModifiable true;

functions
{
    forceCoeffs
    {
        type            forceCoeffs;
        libs            (forces);
        executeControl  timeStep;
        writeControl    timeStep;
        writeInterval   1;
        log             yes;

        patches         (cylinder);
        rho             rho;
        CofR            (0 0 0);
        liftDir         (0 1 0);
        dragDir         (1 0 0);
        pitchAxis       (0 0 1);
        magUInf         0.1263;
        lRef            0.012;
        Aref            0.000120;       // D * z-span = 0.012 * 0.010
    }

    wallHeatFlux_cylinder
    {
        type            wallHeatFlux;
        libs            (fieldFunctionObjects);
        executeControl  timeStep;
        writeControl    timeStep;
        writeInterval   1;
        patches         (cylinder);
        qr              none;
    }

    residuals
    {
        type            solverInfo;
        libs            (utilityFunctionObjects);
        fields          (U p_rgh T);
        writeControl    timeStep;
        writeInterval   1;
    }

    CourantNo
    {
        type            CourantNo;
        libs            (fieldFunctionObjects);
        writeControl    writeTime;
    }
}
