VV_cases/V4a_2D/templates/base_case/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// ============================================================
// V3 / V4a — 2-D periodic tube array
// Pt/D = 2.667  =>  Pt = 0.032 m,  half = 0.016 m
//
// IMPORTANT: top/bottom are symmetryPlane (NOT wall).
// This models the midplane between adjacent tubes in an infinite array.
// This is PHYSICALLY DIFFERENT from V1/V2 which have no-slip walls.
//
// Background cell size ~ 2 mm  =>  168 x 16 x 1
// ============================================================

scale 1;

vertices
(
    (-0.096 -0.016 -0.005)   // 0
    ( 0.240 -0.016 -0.005)   // 1
    ( 0.240  0.016 -0.005)   // 2
    (-0.096  0.016 -0.005)   // 3
    (-0.096 -0.016  0.005)   // 4
    ( 0.240 -0.016  0.005)   // 5
    ( 0.240  0.016  0.005)   // 6
    (-0.096  0.016  0.005)   // 7
);

blocks
(
    // 168 x 16 x 1  (dx ~ 2 mm, dy = 2 mm, dz = 10 mm)
    hex (0 1 2 3 4 5 6 7) (168 16 1) simpleGrading (1 1 1)
);

edges ();

boundary
(
    inlet
    {
        type patch;
        faces ( (0 4 7 3) );
    }
    outlet
    {
        type patch;
        faces ( (1 2 6 5) );
    }
    // symmetryPlane — models the midplane to the next tube in the array
    bottom
    {
        type symmetryPlane;
        faces ( (0 1 5 4) );
    }
    top
    {
        type symmetryPlane;
        faces ( (3 7 6 2) );
    }
    front
    {
        type empty;
        faces ( (0 3 2 1) );
    }
    back
    {
        type empty;
        faces ( (4 5 6 7) );
    }
);

mergePatchPairs ();
