VV_cases/V4a_2D/templates/base_case/0/p_rgh
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
dimensions      [1 -1 -2 0 0 0 0];
internalField   uniform 0;

boundaryField
{
    inlet    { type fixedFluxPressure; value uniform 0; }
    outlet   { type fixedValue; value uniform 0; }
    top      { type symmetryPlane; }
    bottom   { type symmetryPlane; }
    cylinder { type fixedFluxPressure; value uniform 0; }
    front    { type empty; }
    back     { type empty; }
}
