VV_cases/V4a_2D/templates/base_case/0/T
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// V4a: 2-D production geometry — heated cylinder, symmetry walls (adiabatic)
// T_in = 293.15 K,  T_w = 343.15 K
// No fin patches (this is the 2-D case — z is empty/periodic).
// Compare Nu_cylinder here vs V4b to see fin contribution.

dimensions      [0 0 0 1 0 0 0];
internalField   uniform 293.15;

boundaryField
{
    inlet
    {
        type        fixedValue;
        value       uniform 293.15;
    }
    outlet
    {
        type        inletOutlet;
        inletValue  uniform 293.15;
        value       uniform 293.15;
    }
    top
    {
        type        symmetryPlane;
    }
    bottom
    {
        type        symmetryPlane;
    }
    cylinder
    {
        type        fixedValue;
        value       uniform 343.15;
    }
    front
    {
        type        empty;
    }
    back
    {
        type        empty;
    }
}
