VV_cases/V4a_2D/templates/base_case/0/alphat
FoamFile { version 2.0; format ascii; class volScalarField; object alphat; }
// turbulent thermal diffusivity — zero for laminar (simulationType laminar)
dimensions      [1 -1 -1 0 0 0 0];
internalField   uniform 0;
boundaryField { ".*" { type calculated; value uniform 0; } }
