VV_cases/V4a_2D/templates/base_case/system/fvSchemes
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// buoyantPimpleFoam — V2, V4a, V4b (2-D and 3-D thermal cases)

ddtSchemes
{
    default         backward;           // 2nd-order implicit
}

gradSchemes
{
    default         Gauss linear;
    grad(U)         Gauss linear;
    grad(h)         Gauss linear;
}

divSchemes
{
    default         none;
    div(phi,U)      Gauss linearUpwind grad(U);
    div(phi,h)      Gauss linearUpwind grad(h);  // enthalpy transport
    div(phi,K)      Gauss linearUpwind grad(K);  // kinetic energy correction
    div(phid,p)     Gauss limitedLinear 1;       // density-weighted pressure
    div(phi,Ekp)    Gauss linearUpwind grad(Ekp);
    // viscous dissipation term
    div((muEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method          meshWave;
}
