VV_cases/V4a_2D/templates/base_case/system/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// buoyantPimpleFoam — V2, V4a, V4b

solvers
{
    // Density — diagonal direct solver (explicit from EOS)
    "rho.*"
    {
        solver          diagonal;
    }

    p_rgh
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-7;
        relTol          0.01;
    }
    p_rghFinal
    {
        $p_rgh;
        relTol          0;
        tolerance       1e-8;
    }

    "(U|h|e|T)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0.1;
    }
    "(U|h|e|T)Final"
    {
        $U;
        relTol          0;
        tolerance       1e-9;
    }
}

PIMPLE
{
    nOuterCorrectors        2;
    nCorrectors             2;
    nNonOrthogonalCorrectors 1;

    // For buoyantPimpleFoam with compressible solver: no pRefCell needed
    // if outlet has fixedValue p_rgh.
    // Uncomment if divergence occurs:
    // pRefCell   0;
    // pRefValue  0;

    residualControl
    {
        U       1e-5;
        p_rgh   1e-5;
        T       1e-5;
    }
}

relaxationFactors
{
    equations
    {
        U       0.9;
        UFinal  1.0;
        h       0.9;
        hFinal  1.0;
    }
}
